---
kind: method
id: M:Autodesk.Revit.DB.Lighting.SphericalLightDistribution.#ctor(Autodesk.Revit.DB.Lighting.SphericalLightDistribution)
source: html/f4c47d32-3cf2-0e83-6430-c90fdf1467d6.htm
---
# Autodesk.Revit.DB.Lighting.SphericalLightDistribution.#ctor Method

Creates a copy of the given spherical light distribution

## Syntax (C#)
```csharp
public SphericalLightDistribution(
	SphericalLightDistribution other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Lighting.SphericalLightDistribution`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null